Repository: oriveo/oriveo
Catalog: ios/Oriveo/Oriveo/Chat.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, ja, ko, pt_br, ru, th, tr, vi, zh_hans, zh_hant

# file_attachment_count_limit_reached
source: You can attach up to %lld files for this model.
ar: يمكنك إرفاق ما يصل إلى %lld ملفات لهذا النموذج.
de: Für dieses Modell kannst du bis zu %lld Dateien anhängen.
es: Puedes adjuntar hasta %lld archivos para este modelo.
fr: Vous pouvez joindre jusqu’à %lld fichiers pour ce modèle.
hi: इस मॉडल के लिए आप अधिकतम %lld फ़ाइलें जोड़ सकते हैं।
id: Anda dapat melampirkan hingga %lld berkas untuk model ini.
ja: このモデルには最大 %lld 件のファイルを添付できます。
ko: 이 모델에는 최대 %lld개의 파일을 첨부할 수 있습니다.
pt_br: Você pode anexar até %lld arquivos para este modelo.
ru: Для этой модели можно прикрепить до %lld файлов.
th: คุณแนบไฟล์ได้สูงสุด %lld ไฟล์สำหรับโมเดลนี้
tr: Bu model için en fazla %lld dosya ekleyebilirsin.
vi: Bạn có thể đính kèm tối đa %lld tệp cho mô hình này.
zh_hans: 这个模型最多可添加 %lld 个附件。
zh_hant: 這個模型最多可加入 %lld 個附件。

# file_extraction_chip_extracted_lines
source: %lld lines extracted
ar: تم استخراج %lld سطر
de: %lld Zeilen extrahiert
es: %lld líneas extraídas
fr: %lld lignes extraites
hi: %lld पंक्तियाँ निकाली गईं
id: %lld baris diekstrak
ja: %lld 行を抽出しました
ko: %lld줄 추출됨
pt_br: %lld linhas extraídas
ru: Извлечено %lld строк
th: แยก %lld บรรทัด
tr: %lld satır çıkarıldı
vi: Đã trích xuất %lld dòng
zh_hans: 已提取 %lld 行
zh_hant: 已提取 %lld 行

# file_extraction_error_corrupted
source: Couldn't read %@ — the file may be corrupted.
ar: تعذّر قراءة %@ — قد يكون الملف تالفًا.
de: %@ konnte nicht gelesen werden — die Datei ist möglicherweise beschädigt.
es: No se pudo leer %@ — el archivo puede estar dañado.
fr: Impossible de lire %@ — le fichier est peut-être corrompu.
hi: %@ पढ़ा नहीं जा सका — फ़ाइल खराब हो सकती है.
id: Tidak dapat membaca %@ — berkas mungkin rusak.
ja: %@ を読み取れませんでした。ファイルが破損している可能性があります。
ko: %@을(를) 읽을 수 없습니다. 파일이 손상되었을 수 있습니다.
pt_br: Não foi possível ler %@ — o arquivo pode estar corrompido.
ru: Не удалось прочитать %@ — возможно, файл повреждён.
th: อ่าน %@ ไม่ได้ — ไฟล์อาจเสียหาย
tr: %@ okunamadı — dosya bozuk olabilir.
vi: Không thể đọc %@ — tệp có thể đã bị hỏng.
zh_hans: 无法读取 %@，文件可能已损坏。
zh_hant: 無法讀取 %@，檔案可能已損毀。

# file_extraction_error_encrypted_pdf
source: %@ is password-protected. Decrypt the PDF first.
ar: %@ محمي بكلمة مرور. فُك حماية ملف PDF أولاً.
de: %@ ist kennwortgeschützt. Entschlüssle das PDF zuerst.
es: %@ está protegido con contraseña. Descifra el PDF primero.
fr: %@ est protégé par mot de passe. Déchiffrez d'abord le PDF.
hi: %@ पासवर्ड से सुरक्षित है. पहले PDF को अनलॉक करें.
id: %@ dilindungi kata sandi. Dekripsi PDF terlebih dahulu.
ja: %@ はパスワードで保護されています。先に PDF の保護を解除してください。
ko: %@은(는) 비밀번호로 보호되어 있습니다. PDF 보호를 먼저 해제하세요.
pt_br: %@ está protegido por senha. Descriptografe o PDF primeiro.
ru: %@ защищён паролем. Сначала снимите защиту с PDF.
th: %@ มีการป้องกันด้วยรหัสผ่าน โปรดปลดล็อก PDF ก่อน
tr: %@ parola korumalı. Önce PDF'in şifresini çözün.
vi: %@ được bảo vệ bằng mật khẩu. Hãy giải mã PDF trước.
zh_hans: %@ 已加密，请先解密 PDF。
zh_hant: %@ 已加密，請先解密 PDF。

# file_extraction_error_generic
source: Couldn't process %@. Try again or pick another file.
ar: تعذّر معالجة %@. حاول مجدداً أو اختر ملفاً آخر.
de: %@ konnte nicht verarbeitet werden. Versuchen Sie es erneut oder wählen Sie eine andere Datei.
es: No se pudo procesar %@. Inténtalo de nuevo o elige otro archivo.
fr: Impossible de traiter %@. Réessayez ou choisissez un autre fichier.
hi: %@ को प्रोसेस नहीं किया जा सका। दोबारा प्रयास करें या कोई अन्य फ़ाइल चुनें।
id: Tidak dapat memproses %@. Coba lagi atau pilih file lain.
ja: %@ を処理できませんでした。もう一度試すか、別のファイルを選択してください。
ko: %@을(를) 처리할 수 없습니다. 다시 시도하거나 다른 파일을 선택하세요.
pt_br: Não foi possível processar %@. Tente novamente ou escolha outro arquivo.
ru: Не удалось обработать %@. Попробуйте снова или выберите другой файл.
th: ไม่สามารถประมวลผล %@ ได้ ลองอีกครั้งหรือเลือกไฟล์อื่น
tr: %@ işlenemedi. Tekrar deneyin veya başka bir dosya seçin.
vi: Không thể xử lý %@. Thử lại hoặc chọn tệp khác.
zh_hans: 无法处理 %@，请重试或选择其他文件。
zh_hant: 無法處理 %@，請重試或選擇其他檔案。

# file_extraction_error_scanned_pdf
source: Couldn't extract text from %@ (looks like a scanned PDF).
ar: تعذّر استخراج النص من %@ (يبدو أنه ملف PDF ممسوح ضوئيًا).
de: Text konnte nicht aus %@ extrahiert werden (sieht wie ein gescanntes PDF aus).
es: No se pudo extraer texto de %@ (parece un PDF escaneado).
fr: Impossible d'extraire le texte de %@ (semble être un PDF numérisé).
hi: %@ से टेक्स्ट नहीं निकाला जा सका (यह स्कैन किया गया PDF लगता है).
id: Tidak dapat mengekstrak teks dari %@ (sepertinya PDF hasil pindaian).
ja: %@ からテキストを抽出できませんでした（スキャンされた PDF のようです）。
ko: %@에서 텍스트를 추출할 수 없습니다(스캔한 PDF로 보입니다).
pt_br: Não foi possível extrair texto de %@ (parece ser um PDF digitalizado).
ru: Не удалось извлечь текст из %@ (похоже на отсканированный PDF).
th: ไม่สามารถแยกข้อความจาก %@ ได้ (ดูเหมือนเป็น PDF ที่สแกนมา)
tr: %@ dosyasından metin çıkarılamadı (taranmış bir PDF gibi görünüyor).
vi: Không thể trích xuất văn bản từ %@ (có vẻ là PDF đã quét).
zh_hans: 无法从 %@ 中提取文字（看起来是扫描版 PDF）。
zh_hant: 無法從 %@ 中提取文字（看起來是掃描版 PDF）。

# file_extraction_error_too_large
source: %@ is too large (max 50 MB).
ar: %@ كبير جدًا (الحد الأقصى 50 ميجابايت).
de: %@ ist zu groß (max. 50 MB).
es: %@ es demasiado grande (máx. 50 MB).
fr: %@ est trop volumineux (50 Mo max.).
hi: %@ बहुत बड़ी है (अधिकतम 50 MB).
id: %@ terlalu besar (maks. 50 MB).
ja: %@ は大きすぎます（最大 50 MB）。
ko: %@이(가) 너무 큽니다(최대 50 MB).
pt_br: %@ é muito grande (máx. 50 MB).
ru: %@ слишком большой (максимум 50 МБ).
th: %@ มีขนาดใหญ่เกินไป (สูงสุด 50 MB)
tr: %@ çok büyük (en fazla 50 MB).
vi: %@ quá lớn (tối đa 50 MB).
zh_hans: %@ 太大（最大 50 MB）。
zh_hant: %@ 太大（最大 50 MB）。

# file_extraction_error_unsupported
source: %@ is not a supported file type.
ar: %@ ليس نوع ملف مدعوم.
de: %@ ist kein unterstützter Dateityp.
es: %@ no es un tipo de archivo compatible.
fr: %@ n'est pas un type de fichier pris en charge.
hi: %@ समर्थित फ़ाइल प्रकार नहीं है.
id: %@ bukan jenis berkas yang didukung.
ja: %@ はサポートされていないファイル形式です。
ko: %@은(는) 지원되지 않는 파일 형식입니다.
pt_br: %@ não é um tipo de arquivo compatível.
ru: %@ — неподдерживаемый тип файла.
th: %@ ไม่ใช่ชนิดไฟล์ที่รองรับ
tr: %@ desteklenen bir dosya türü değil.
vi: %@ không phải là loại tệp được hỗ trợ.
zh_hans: %@ 不是受支持的文件类型。
zh_hant: %@ 不是支援的檔案類型。

# file_extraction_truncated_cta_knowledge
source: Large file truncated. Add to Skill Knowledge for full search →
ar: تم اقتطاع الملف الكبير. أضف إلى Skill Knowledge للبحث الكامل ←
de: Große Datei abgeschnitten. Zu Skill Knowledge hinzufügen für vollständige Suche →
es: Archivo grande truncado. Agregar a Skill Knowledge para búsqueda completa →
fr: Fichier volumineux tronqué. Ajouter à Skill Knowledge pour une recherche complète →
hi: बड़ी फ़ाइल काट दी गई। पूरी खोज के लिए इसे कौशल नॉलेज बेस में जोड़ें →
id: File besar dipotong. Tambahkan ke Skill Knowledge untuk pencarian lengkap →
ja: 大きなファイルが切り詰められました。完全な検索のために Skill Knowledge に追加 →
ko: 큰 파일이 잘렸습니다. 전체 검색을 위해 Skill Knowledge에 추가 →
pt_br: Arquivo grande truncado. Adicionar ao Skill Knowledge para busca completa →
ru: Большой файл обрезан. Добавьте в Skill Knowledge для полного поиска →
th: ไฟล์ขนาดใหญ่ถูกตัดทอน เพิ่มลงใน Skill Knowledge เพื่อค้นหาแบบเต็ม →
tr: Büyük dosya kısaltıldı. Tam arama için Skill Knowledge'a ekleyin →
vi: Tệp lớn đã bị cắt. Thêm vào Skill Knowledge để tìm kiếm đầy đủ →
zh_hans: 大文件已截断。添加到 Skill Knowledge 获取完整检索 →
zh_hant: 大檔案已截斷。新增到 Skill Knowledge 取得完整檢索 →

source: Files and images over %@ cannot be uploaded. Large uploads are slow on your network and are difficult for AI models to read reliably.
ar: لا يمكن رفع الملفات أو الصور التي يزيد حجمها عن %@. الرفع الكبير يبطئ الشبكة ويصعب على نماذج الذكاء الاصطناعي قراءته بثبات.
de: Dateien und Bilder über %@ können nicht hochgeladen werden. Große Uploads belasten dein Netzwerk und sind für KI-Modelle schwer zuverlässig zu lesen.
es: No se pueden subir archivos ni imágenes de más de %@. Las cargas grandes son lentas en tu red y son difíciles de leer de forma fiable para los modelos de IA.
fr: Les fichiers et images de plus de %@ ne peuvent pas être importés. Les gros envois sont lents sur votre réseau et difficiles à lire de façon fiable pour les modèles d’IA.
hi: %@ से बड़ी फ़ाइलें और छवियाँ अपलोड नहीं की जा सकतीं। बड़े अपलोड आपके नेटवर्क पर धीमे होते हैं और AI मॉडल के लिए उन्हें भरोसेमंद ढंग से पढ़ना कठिन होता है।
id: Berkas dan gambar di atas %@ tidak dapat diunggah. Unggahan besar lambat di jaringan Anda dan sulit dibaca model AI secara andal.
ja: %@ を超えるファイルや画像はアップロードできません。大きなアップロードは通信に負担がかかり、AI も安定して読み取れません。
ko: %@를 초과하는 파일과 이미지는 업로드할 수 없습니다. 큰 업로드는 네트워크에 부담이 되며 AI가 안정적으로 읽기 어렵습니다.
pt_br: Arquivos e imagens acima de %@ não podem ser enviados. Uploads grandes são lentos na sua rede e difíceis para os modelos de IA lerem com confiabilidade.
ru: Файлы и изображения больше %@ загрузить нельзя. Большие загрузки идут медленно и плохо читаются моделями.
th: ไม่สามารถอัปโหลดไฟล์และรูปภาพที่เกิน %@ ได้ ไฟล์ขนาดใหญ่อัปโหลดช้าบนเครือข่ายของคุณและโมเดล AI อ่านได้ยาก
tr: %@ üzerindeki dosyalar ve görseller yüklenemez. Büyük yüklemeler ağında yavaştır ve yapay zekâ modellerinin güvenilir biçimde okuması zordur.
vi: Không thể tải lên tệp và ảnh lớn hơn %@. Tệp lớn tải chậm trên mạng của bạn và mô hình AI khó đọc chính xác.
zh_hans: 超过 %@ 的文件和图片无法上传。大文件上传会拖慢你的网络，也更难让 AI 模型稳定读取。
zh_hant: 超過 %@ 的檔案和圖片無法上傳。大型上傳會拖慢你的網路，也更難讓 AI 模型穩定讀取。

source: For this connection, use the documentation supplied by its administrator.
ar: لهذا الاتصال، استخدم الوثائق التي يوفّرها مسؤوله.
de: Verwende für diese Verbindung die Dokumentation ihres Administrators.
es: Para esta conexión, usa la documentación proporcionada por su administrador.
fr: Pour cette connexion, utilisez la documentation fournie par son administrateur.
hi: इस कनेक्शन के लिए इसके व्यवस्थापक द्वारा दिए गए दस्तावेज़ देखें।
id: Untuk koneksi ini, gunakan dokumentasi dari administratornya.
ja: この接続では、管理者が提供するドキュメントを参照してください。
ko: 이 연결에서는 관리자가 제공한 문서를 참고하세요.
pt_br: Para esta conexão, use a documentação fornecida pelo administrador.
ru: Для этого подключения используйте документацию от его администратора.
th: สำหรับการเชื่อมต่อนี้ ให้ใช้เอกสารจากผู้ดูแลระบบ
tr: Bu bağlantı için yöneticisinin sağladığı belgeleri kullanın.
vi: Với kết nối này, hãy dùng tài liệu do quản trị viên cung cấp.
zh_hans: 此连接请参考管理员提供的文档。
zh_hant: 此連線請參考管理員提供的文件。

source: Frequency penalty
ar: عقوبة التواتر
de: Häufigkeitsstrafe
es: Penalización de frecuencia
fr: Pénalité de fréquence
hi: फ़्रीक्वेंसी पेनल्टी
id: Penalti frekuensi
ja: 頻度ペナルティ
ko: 빈도 페널티
pt_br: Penalidade de frequência
ru: Штраф за частоту
th: บทลงโทษความถี่
tr: Sıklık cezası
vi: Mức phạt tần suất
zh_hans: 频率惩罚
zh_hant: 頻率懲罰

source: Full quoted context
ar: سياق الاقتباس الكامل
de: Vollständiger Zitatkontext
es: Contexto completo de la cita
fr: Contexte complet de la citation
hi: उद्धरण का पूरा संदर्भ
id: Konteks kutipan lengkap
ja: 引用の完全なコンテキスト
ko: 전체 인용 문맥
pt_br: Contexto completo da citação
ru: Полный контекст цитаты
th: บริบทคำอ้างอิงทั้งหมด
tr: Alıntının tam bağlamı
vi: Ngữ cảnh trích dẫn đầy đủ
zh_hans: 完整引用上下文
zh_hant: 完整引用上下文

source: Go to Advanced Settings
ar: الانتقال إلى الإعدادات المتقدمة
de: Zu erweiterten Einstellungen
es: Ir a ajustes avanzados
fr: Aller aux réglages avancés
hi: उन्नत सेटिंग्स पर जाएँ
id: Buka pengaturan lanjutan
ja: 詳細設定へ
ko: 고급 설정으로 이동
pt_br: Ir para configurações avançadas
ru: Перейти к расширенным настройкам
th: ไปที่การตั้งค่าขั้นสูง
tr: Gelişmiş ayarlara git
vi: Đến cài đặt nâng cao
zh_hans: 前往高级设置
zh_hant: 前往進階設定

source: Grammar (GBNF)
ar: قيد القواعد (GBNF)
de: Grammatik (GBNF)
es: Gramática (GBNF)
fr: Grammaire (GBNF)
hi: व्याकरण बाध्यता (GBNF)
id: Tata bahasa (GBNF)
ja: 文法制約（GBNF）
ko: 문법 제약(GBNF)
pt_br: Gramática (GBNF)
ru: Грамматика (GBNF)
th: ข้อจำกัดไวยากรณ์ (GBNF)
tr: Dilbilgisi kısıtı (GBNF)
vi: Ràng buộc ngữ pháp (GBNF)
zh_hans: 语法约束（GBNF）
zh_hant: 語法約束（GBNF）

source: Grey numbers are %@’s own defaults. They aren’t sent unless you change them.
ar: الأرقام الرمادية هي القيم الافتراضية الخاصة بـ %@، ولا تُرسل ما لم تُغيَّر.
de: Graue Werte sind die eigenen Standardwerte von %@. Sie werden nur gesendet, wenn Sie sie ändern.
es: Los números en gris son los valores predeterminados de %@. No se envían a menos que los cambies.
fr: Les valeurs en gris sont les valeurs par défaut propres à %@. Elles ne sont envoyées que si vous les modifiez.
hi: ग्रे संख्याएँ %@ के अपने डिफ़ॉल्ट हैं। जब तक आप इन्हें न बदलें, ये नहीं भेजी जातीं।
id: Angka abu-abu adalah nilai bawaan %@ sendiri. Angka ini tidak dikirim kecuali Anda mengubahnya.
ja: グレーの数値は %@ 本来のデフォルトです。変更しない限り送信されません。
ko: 회색 숫자는 %@ 자체 기본값이에요. 바꾸지 않으면 보내지 않아요.
pt_br: Os números em cinza são os padrões do próprio %@. Eles só são enviados se você os alterar.
ru: Серые значения — собственные значения %@ по умолчанию. Они не отправляются, пока вы их не измените.
th: ตัวเลขสีเทาคือค่าเริ่มต้นของ %@ เอง จะไม่ถูกส่งเว้นแต่คุณจะเปลี่ยน
tr: Gri sayılar %@ tarafının kendi varsayılanlarıdır. Siz değiştirmedikçe gönderilmezler.
vi: Số màu xám là giá trị mặc định riêng của %@. Chúng không được gửi trừ khi bạn thay đổi.
zh_hans: 灰色数字是 %@ 自己的默认值，你没改就不发送。
zh_hant: 灰色數字是 %@ 本身的預設值，沒有更改就不會傳送。

source: Hard questions, take more time.
ar: أسئلة صعبة تحتاج وقتًا أطول.
de: Schwierige Fragen, mehr Denkzeit.
es: Preguntas difíciles, más tiempo de razonamiento.
fr: Questions difficiles, plus de temps de réflexion.
hi: कठिन प्रश्न, अधिक समय।
id: Pertanyaan sulit, butuh waktu lebih.
ja: 難しい質問にじっくり時間をかけます。
ko: 어려운 질문, 시간을 더 들입니다.
pt_br: Perguntas difíceis, mais tempo pensando.
ru: Сложные вопросы — больше времени.
th: คำถามยาก ใช้เวลาคิดมากขึ้น
tr: Zor sorular, daha fazla süre.
vi: Câu hỏi khó, suy nghĩ lâu hơn.
zh_hans: 复杂问题，多想一会儿。
zh_hant: 複雜問題，多想一會兒。

source: Hide thinking
ar: إخفاء التفكير
de: Denkprozess ausblenden
es: Ocultar razonamiento
fr: Masquer la réflexion
hi: सोच छिपाएँ
id: Sembunyikan pemikiran
ja: 思考過程を非表示
ko: 생각 과정 숨기기
pt_br: Ocultar raciocínio
ru: Скрыть рассуждение
th: ซ่อนการคิด
tr: Düşünceyi gizle
vi: Ẩn suy nghĩ
zh_hans: 隐藏思考过程
zh_hant: 隱藏思考過程

source: Higher levels take longer and may cost more.
ar: المستويات الأعلى تستغرق وقتًا أطول وقد تكلّف أكثر.
de: Höhere Stufen dauern länger und können mehr kosten.
es: Los niveles más altos tardan más y pueden costar más.
fr: Plus le niveau est élevé, plus la réponse est lente et potentiellement coûteuse.
hi: ऊँचे स्तर पर ज़्यादा समय लगता है और खर्च भी बढ़ सकता है।
id: Tingkat yang lebih tinggi lebih lama dan bisa lebih mahal.
ja: レベルが高いほど時間がかかり、料金が増えることがあります。
ko: 단계가 높을수록 오래 걸리고 비용이 늘 수 있어요.
pt_br: Níveis mais altos demoram mais e podem custar mais.
ru: Чем выше уровень, тем дольше ответ и, возможно, выше стоимость.
th: ระดับยิ่งสูงยิ่งใช้เวลานาน และอาจมีค่าใช้จ่ายมากขึ้น
tr: Düzey yükseldikçe süre uzar, maliyet de artabilir.
vi: Mức càng cao càng lâu và có thể tốn phí hơn.
zh_hans: 档位越高越慢，也可能更贵。
zh_hant: 檔位越高越慢，也可能更貴。

source: Ignore EOS token
ar: تجاهل رمز EOS
de: EOS-Token ignorieren
es: Ignorar el token EOS
fr: Ignorer le token EOS
hi: EOS टोकन को अनदेखा करें
id: Abaikan token EOS
ja: EOS トークンを無視
ko: EOS 토큰 무시
pt_br: Ignorar o token EOS
ru: Игнорировать токен EOS
th: ไม่สนใจโทเค็น EOS
tr: EOS token’ını yok say
vi: Bỏ qua token EOS
zh_hans: 忽略 EOS Token
zh_hant: 忽略 EOS Token

source: In the %1$@ fields, line %2$lld: %3$@
ar: حقول %1$@، السطر %2$lld: %3$@
de: %1$@-Felder, Zeile %2$lld: %3$@
es: Campos de «%1$@», línea %2$lld: %3$@
fr: Champs « %1$@ », ligne %2$lld : %3$@
hi: %1$@ फ़ील्ड, पंक्ति %2$lld: %3$@
id: Kolom %1$@, baris %2$lld: %3$@
ja: %1$@のフィールド（%2$lld 行目）：%3$@
ko: %1$@ 필드 %2$lld행: %3$@
pt_br: Campos de “%1$@”, linha %2$lld: %3$@
ru: Поля «%1$@», строка %2$lld: %3$@
th: ฟิลด์%1$@ บรรทัดที่ %2$lld: %3$@
tr: %1$@ alanları, %2$lld. satır: %3$@
vi: Trường %1$@, dòng %2$lld: %3$@
zh_hans: %1$@字段第 %2$lld 行：%3$@
zh_hant: %1$@欄位第 %2$lld 行：%3$@

source: In the %1$@ fields: %2$@
ar: حقول %1$@: %2$@
de: %1$@-Felder: %2$@
es: Campos de «%1$@»: %2$@
fr: Champs « %1$@ » : %2$@
hi: %1$@ फ़ील्ड: %2$@
id: Kolom %1$@: %2$@
ja: %1$@のフィールド：%2$@
ko: %1$@ 필드: %2$@
pt_br: Campos de “%1$@”: %2$@
ru: Поля «%1$@»: %2$@
th: ฟิลด์%1$@: %2$@
tr: %1$@ alanları: %2$@
vi: Trường %1$@: %2$@
zh_hans: %1$@字段：%2$@
zh_hant: %1$@欄位：%2$@

source: Included
ar: مُضمَّن
de: Enthalten
es: Incluido
fr: Inclus
hi: शामिल
id: Disertakan
ja: 送信対象
ko: 포함
pt_br: Incluído
ru: Добавляется
th: รวมไว้
tr: Eklenir
vi: Bao gồm
zh_hans: 加入
zh_hant: 加入

source: Input
ar: الإدخال
de: Eingabe
es: Entrada
fr: Entrée
hi: इनपुट
ja: 入力
ko: 입력
pt_br: Entrada
ru: Ввод
th: อินพุต
tr: Girdi
vi: Đầu vào
zh_hans: 输入
zh_hant: 輸入

source: Jump to: %@
ar: الانتقال إلى: %@
de: Springe zu: %@
es: Ir a: %@
fr: Aller à : %@
hi: यहाँ जाएँ: %@
id: Lompat ke: %@
ja: 移動：%@
ko: 이동: %@
pt_br: Ir para: %@
ru: Перейти к: %@
th: ไปที่: %@
tr: Şuna git: %@
vi: Chuyển đến: %@
zh_hans: 跳到：%@
zh_hant: 跳到：%@

source: Keep custom fields
ar: الاحتفاظ بالحقول المخصصة
de: Benutzerdefinierte Felder behalten
es: Conservar campos personalizados
fr: Conserver les champs personnalisés
hi: कस्टम फ़ील्ड रखें
id: Pertahankan kolom kustom
ja: カスタム項目を保持
ko: 사용자 지정 필드 유지
pt_br: Manter campos personalizados
ru: Сохранить пользовательские поля
th: เก็บฟิลด์แบบกำหนดเองไว้
tr: Özel alanları koru
vi: Giữ trường tùy chỉnh
zh_hans: 保留自定义字段
zh_hant: 保留自訂欄位

source: Keeps the randomness of the output steady around a target, in place of Top K and Top P.
ar: يُبقي عشوائية المخرجات ثابتة حول قيمة مستهدفة، بدلًا من Top K وTop P.
de: Hält die Zufälligkeit der Ausgabe stabil um einen Zielwert – anstelle von Top K und Top P.
es: Mantiene estable la aleatoriedad de la salida en torno a un objetivo, en lugar de Top K y Top P.
fr: Maintient le caractère aléatoire de la sortie autour d’une valeur cible, à la place de Top K et Top P.
hi: आउटपुट की रैंडमनेस को एक लक्ष्य के आसपास स्थिर रखता है; Top K और Top P की जगह इस्तेमाल होता है।
id: Menjaga tingkat keacakan output tetap stabil di sekitar target, sebagai pengganti Top K dan Top P.
ja: 出力のランダムさを目標値の付近に保ちます。Top K と Top P の代わりに使います。
ko: 출력의 무작위성을 목표값 근처로 유지해요. Top K와 Top P 대신 쓰여요.
pt_br: Mantém a aleatoriedade da saída estável em torno de um alvo, no lugar de Top K e Top P.
ru: Удерживает случайность вывода около целевого уровня — вместо Top K и Top P.
th: รักษาระดับความสุ่มของผลลัพธ์ให้คงที่ใกล้ค่าเป้าหมาย ใช้แทน Top K และ Top P
tr: Top K ve Top P yerine, çıktının rastgeleliğini bir hedef değer etrafında sabit tutar.
vi: Giữ độ ngẫu nhiên của đầu ra ổn định quanh một mức mục tiêu, thay cho Top K và Top P.
zh_hans: 自动把输出的随机程度稳在一个目标上，代替 Top K 和 Top P。
zh_hant: 自動將輸出的隨機程度穩定在目標值附近，取代 Top K 與 Top P。

source: Learning rate
ar: معدل التعلّم
de: Lernrate
es: Tasa de aprendizaje
fr: Taux d’apprentissage
hi: लर्निंग रेट
id: Laju pembelajaran
ja: 学習率
ko: 학습률
pt_br: Taxa de aprendizado
ru: Скорость обучения
th: อัตราการเรียนรู้
tr: Öğrenme oranı
vi: Tốc độ học
zh_hans: 学习率
zh_hant: 學習率

source: Line %lld: %@
ar: السطر %lld: %@
de: Zeile %lld: %@
es: Línea %lld: %@
fr: Ligne %lld : %@
hi: पंक्ति %lld: %@
id: Baris %lld: %@
ja: %lld 行目：%@
ko: %lld번째 줄: %@
pt_br: Linha %lld: %@
ru: Строка %lld: %@
th: บรรทัดที่ %lld: %@
tr: Satır %lld: %@
vi: Dòng %lld: %@
zh_hans: 第 %lld 行：%@
zh_hant: 第 %lld 行：%@

source: Loading conversation…
ar: جارٍ تحميل المحادثة…
de: Unterhaltung wird geladen …
es: Cargando la conversación…
fr: Chargement de la conversation…
hi: बातचीत लोड हो रही है…
id: Memuat percakapan…
ja: 会話を読み込んでいます…
ko: 대화를 불러오는 중…
pt_br: Carregando a conversa…
ru: Загрузка чата…
th: กำลังโหลดการสนทนา…
tr: Sohbet yükleniyor…
vi: Đang tải cuộc trò chuyện…
zh_hans: 正在加载会话…
zh_hant: 正在載入對話…

source: Local
ar: محلي
de: Lokal
hi: लोकल
id: Lokal
ja: ローカル
ko: 로컬
ru: Локально
th: ในเครื่อง
tr: Yerel
vi: Cục bộ
zh_hans: 本机
zh_hant: 本機

source: Log probabilities
ar: الاحتمالات اللوغاريتمية
de: Log-Wahrscheinlichkeiten
es: Probabilidades logarítmicas
fr: Log-probabilités
hi: लॉग संभावनाएँ
id: Probabilitas log
ja: 対数確率
ko: 로그 확률
pt_br: Probabilidades logarítmicas
ru: Логарифмические вероятности
th: ความน่าจะเป็นแบบลอการิทึม
tr: Log olasılıkları
vi: Xác suất log
zh_hans: 对数概率
zh_hant: 對數機率

source: Manual
ar: يدوي
de: Manuell
fr: Manuel
hi: मैनुअल
ja: 手動
ko: 수동
ru: Вручную
th: กำหนดเอง
tr: Manuel
vi: Thủ công
zh_hans: 需手动
zh_hant: 需手動

source: Max Tokens
ar: الحد الأقصى للرموز
de: Max. Token
es: Máximo de tokens
fr: Nombre maximal de tokens
hi: अधिकतम टोकन
id: Token maksimum
ja: 最大トークン数
ko: 최대 토큰 수
pt_br: Máximo de tokens
ru: Максимум токенов
th: จำนวนโทเค็นสูงสุด
tr: Maksimum token
vi: Số token tối đa
zh_hans: 最大 Token 数
zh_hant: 最大 Token 數

source: Max tokens, temperature, and other request parameters
ar: الحد الأقصى للرموز ودرجة الحرارة ومعاملات الطلب الأخرى
de: Max. Token, Temperatur und weitere Anfrageparameter
es: Máximo de tokens, temperatura y otros parámetros de solicitud
fr: Nombre max. de tokens, température et autres paramètres de requête
hi: अधिकतम टोकन, तापमान और अन्य अनुरोध पैरामीटर
id: Token maksimum, suhu, dan parameter permintaan lainnya
ja: 最大トークン数・温度などのリクエストパラメータ
ko: 최대 토큰 수, 온도 등 요청 매개변수
pt_br: Máximo de tokens, temperatura e outros parâmetros de solicitação
ru: Максимум токенов, температура и другие параметры запроса
th: จำนวนโทเค็นสูงสุด อุณหภูมิ และพารามิเตอร์คำขออื่น ๆ
tr: Maksimum token, sıcaklık ve diğer istek parametreleri
vi: Số token tối đa, nhiệt độ và các tham số yêu cầu khác
zh_hans: 温度、最大 Token 数等
zh_hant: 溫度、最大 Token 數等

source: Messages aren't available yet
ar: الرسائل غير متاحة بعد
de: Nachrichten sind noch nicht verfügbar
es: Los mensajes aún no están disponibles
fr: Les messages ne sont pas encore disponibles
hi: संदेश अभी उपलब्ध नहीं हैं
id: Pesan belum tersedia
ja: メッセージをまだ取得できていません
ko: 메시지를 아직 불러오지 못했습니다
pt_br: As mensagens ainda não estão disponíveis
ru: Сообщения пока недоступны
th: ยังไม่สามารถโหลดข้อความได้
tr: Mesajlar henüz kullanılamıyor
vi: Tin nhắn chưa sẵn sàng
zh_hans: 消息还没取回来
zh_hant: 訊息還沒取回來

source: Minimum line indentation
ar: الحد الأدنى لإزاحة السطر
de: Mindesteinrückung pro Zeile
es: Sangría mínima de línea
fr: Indentation minimale des lignes
hi: पंक्ति का न्यूनतम इंडेंटेशन
id: Indentasi baris minimum
ja: 最小の行インデント
ko: 최소 줄 들여쓰기
pt_br: Recuo mínimo de linha
ru: Минимальный отступ строки
th: การย่อหน้าบรรทัดขั้นต่ำ
tr: En az satır girintisi
vi: Thụt lề dòng tối thiểu
zh_hans: 最小行缩进
zh_hant: 最小行縮排

source: Minimum output tokens
ar: الحد الأدنى لرموز المخرجات
de: Mindestanzahl Ausgabe-Token
es: Mínimo de tokens de salida
fr: Nombre minimal de tokens en sortie
hi: न्यूनतम आउटपुट टोकन
id: Token keluaran minimum
ja: 最小出力トークン数
ko: 최소 출력 토큰 수
pt_br: Mínimo de tokens de saída
ru: Минимум токенов в ответе
th: จำนวนโทเค็นเอาต์พุตขั้นต่ำ
tr: En az çıktı token sayısı
vi: Số token đầu ra tối thiểu
zh_hans: 最少输出 Token 数
zh_hant: 最少輸出 Token 數

source: Minimum tokens to keep
ar: الحد الأدنى من الرموز المحتفَظ بها
de: Mindestanzahl beizubehaltender Token
es: Mínimo de tokens a conservar
fr: Nombre minimal de tokens conservés
hi: कम से कम रखे जाने वाले टोकन
id: Minimum token yang dipertahankan
ja: 最小保持トークン数
ko: 최소 유지 토큰 수
pt_br: Mínimo de tokens mantidos
ru: Минимум сохраняемых токенов
th: จำนวนโทเค็นขั้นต่ำที่เก็บไว้
tr: Korunacak en az token sayısı
vi: Số token giữ lại tối thiểu
zh_hans: 最少保留 Token 数
zh_hant: 最少保留 Token 數

source: Mirostat learning rate
ar: معدل التعلّم في Mirostat
de: Mirostat-Lernrate
es: Tasa de aprendizaje de Mirostat
fr: Taux d’apprentissage Mirostat
hi: Mirostat लर्निंग रेट
id: Laju pembelajaran Mirostat
ja: Mirostat 学習率
ko: Mirostat 학습률
pt_br: Taxa de aprendizado do Mirostat
ru: Скорость обучения Mirostat
th: อัตราการเรียนรู้ของ Mirostat
tr: Mirostat öğrenme oranı
vi: Tốc độ học Mirostat
zh_hans: Mirostat 学习率
zh_hant: Mirostat 學習率
